---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.TextFailures
source: html/184dc92b-abee-03c2-0034-34b7014b9d29.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TextFailures

Failures about Text.

## Syntax (C#)
```csharp
public static class TextFailures
```